---
title: PipeFittingAndAccessoryData
classe: Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# PipeFittingAndAccessoryData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 BehaviorType { get; }` | `pipeFittingAndAccessoryData.BehaviorType` | Int32 |
| `Double FluidDensity { get; }` | `pipeFittingAndAccessoryData.FluidDensity` | Double |
| `Double FluidViscosity { get; }` | `pipeFittingAndAccessoryData.FluidViscosity` | Double |
| `Boolean IsValidObject { get; }` | `pipeFittingAndAccessoryData.IsValidObject` | Boolean |
| `XYZ Origin { get; }` | `pipeFittingAndAccessoryData.Origin` | XYZ |
| `PartType PartType { get; }` | `pipeFittingAndAccessoryData.PartType` | PartType |
| `Guid ServerGUID { get; }` | `pipeFittingAndAccessoryData.ServerGUID` | Guid |
| `MEPSystemClassification SystemClassification { get; }` | `pipeFittingAndAccessoryData.SystemClassification` | MEPSystemClassification |
| `Void Dispose()` | `pipeFittingAndAccessoryData.Dispose()` | Void |
| `IList<PipeFittingAndAccessoryConnectorData> GetAllConnectorData()` | `pipeFittingAndAccessoryData.GetAllConnectorData()` | IList<PipeFittingAndAccessoryConnectorData> |
| `Entity GetEntity()` | `pipeFittingAndAccessoryData.GetEntity()` | Entity |
| `ElementId GetFamilyInstanceId()` | `pipeFittingAndAccessoryData.GetFamilyInstanceId()` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```